jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x261x.cpp
#ifndef MPY_
#define MPY_ 0x0130
#endif
#ifndef MPY
#define MPY 0x0130
#endif
#ifndef CAL_BC1_8MHZ
#define CAL_BC1_8MHZ 0x0005
#endif
#ifndef __msp430_headers_flash_h
#define __msp430_headers_flash_h 
#endif
#ifndef FCTL1_
#define FCTL1_ 0x0128
#endif
#ifndef FCTL1
#define FCTL1 0x0128
#endif
#ifndef MSC
#define MSC 0x0080
#endif
#ifndef MSH
#define MSH 0x0080
#endif
#ifndef INCH_VCC2
#define INCH_VCC2 11
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __MSP430_HAS_PORT3_R__
#define __MSP430_HAS_PORT3_R__ 
#endif
#ifndef __MSP430_HAS_PORT3_R_
#define __MSP430_HAS_PORT3_R_ 
#endif
#ifndef __FLT_MIN__
#define __FLT_MIN__ 1.17549435e-38F
#endif
#ifndef __FLT_MIN_
#define __FLT_MIN_ 1.17549435e-38F
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef P1IES
#define P1IES 0x0024
#endif
#ifndef REF2_5V
#define REF2_5V 0x0040
#endif
#ifndef DAC12AMP0
#define DAC12AMP0 0x0020
#endif
#ifndef DAC12AMP1
#define DAC12AMP1 0x0040
#endif
#ifndef DAC12AMP2
#define DAC12AMP2 0x0080
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef __ASSEMBLER_
#define __ASSEMBLER_ 1
#endif
#ifndef XTS
#define XTS 0x40
#endif
#ifndef CAL_ADC_25VREF_FACTOR
#define CAL_ADC_25VREF_FACTOR 0x0005
#endif
#ifndef __CHAR_BIT__
#define __CHAR_BIT__ 8
#endif
#ifndef __CHAR_BIT_
#define __CHAR_BIT_ 8
#endif
#ifndef DMA2CTL_
#define DMA2CTL_ 0x01E8
#endif
#ifndef DMA2CTL
#define DMA2CTL 0x01E8
#endif
#ifndef P5DIR_
#define P5DIR_ 0x0032
#endif
#ifndef P5DIR
#define P5DIR 0x0032
#endif
#ifndef TBSSEL_ACLK
#define TBSSEL_ACLK TBSSEL_1
#endif
#ifndef P8OUT_
#define P8OUT_ 0x003B
#endif
#ifndef P8OUT
#define P8OUT 0x003B
#endif
#ifndef __WINT_MAX__
#define __WINT_MAX__ 65535U
#endif
#ifndef __WINT_MAX_
#define __WINT_MAX_ 65535U
#endif
#ifndef TA0R_
#define TA0R_ 0x0170
#endif
#ifndef TA0R
#define TA0R 0x0170
#endif
#ifndef CAL_DCO_1MHZ
#define CAL_DCO_1MHZ 0x0006
#endif
#ifndef ADC12MCTL10_
#define ADC12MCTL10_ 0x008A
#endif
#ifndef ADC12MCTL10
#define ADC12MCTL10 0x008A
#endif
#ifndef __MSP430_HAS_DMAX_3__
#define __MSP430_HAS_DMAX_3__ 
#endif
#ifndef __MSP430_HAS_DMAX_3_
#define __MSP430_HAS_DMAX_3_ 
#endif
#ifndef __msp430_have_timerb7
#define __msp430_have_timerb7 
#endif
#ifndef SHT1_DIV384
#define SHT1_DIV384 SHT1_9
#endif
#ifndef P8SEL_
#define P8SEL_ 0x003F
#endif
#ifndef P8SEL
#define P8SEL 0x003F
#endif
#ifndef __SIZE_MAX__
#define __SIZE_MAX__ 65535U
#endif
#ifndef __SIZE_MAX_
#define __SIZE_MAX_ 65535U
#endif
#ifndef __WCHAR_MAX__
#define __WCHAR_MAX__ 32767
#endif
#ifndef __WCHAR_MAX_
#define __WCHAR_MAX_ 32767
#endif
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef UCB1I2CIE_
#define UCB1I2CIE_ 0x00DC
#endif
#ifndef UCB1I2CIE
#define UCB1I2CIE 0x00DC
#endif
#ifndef SEGWRT
#define SEGWRT 0x0080
#endif
#ifndef DMAIV_
#define DMAIV_ 0x0126
#endif
#ifndef DMAIV
#define DMAIV 0x0126
#endif
#ifndef __FLT_EVAL_METHOD__
#define __FLT_EVAL_METHOD__ 0
#endif
#ifndef __FLT_EVAL_METHOD_
#define __FLT_EVAL_METHOD_ 0
#endif
#ifndef CAL_DCO_16MHZ
#define CAL_DCO_16MHZ 0x0000
#endif
#ifndef DMA2SA_
#define DMA2SA_ 0x01EA
#endif
#ifndef DMA2SA
#define DMA2SA 0x01EA
#endif
#ifndef TAG_ADC12_1
#define TAG_ADC12_1 0x10
#endif
#ifndef XT2OF
#define XT2OF 0x02
#endif
#ifndef __MSP430_HAS_FLASH2__
#define __MSP430_HAS_FLASH2__ 
#endif
#ifndef __MSP430_HAS_FLASH2_
#define __MSP430_HAS_FLASH2_ 
#endif
#ifndef P3REN_
#define P3REN_ 0x0010
#endif
#ifndef P3REN
#define P3REN 0x0010
#endif
#ifndef FN0
#define FN0 0x0001
#endif
#ifndef FN1
#define FN1 0x0002
#endif
#ifndef FN3
#define FN3 0x0008
#endif
#ifndef FN4
#define FN4 0x0010
#endif
#ifndef FN5
#define FN5 0x0020
#endif
#ifndef SELS
#define SELS 0x08
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef SHT0_DIV256
#define SHT0_DIV256 SHT0_8
#endif
#ifndef UCA1BR0_
#define UCA1BR0_ 0x00D2
#endif
#ifndef UCA1BR0
#define UCA1BR0 0x00D2
#endif
#ifndef CAIES
#define CAIES 0x04
#endif
#ifndef UCA1BR1_
#define UCA1BR1_ 0x00D3
#endif
#ifndef UCA1BR1
#define UCA1BR1 0x00D3
#endif
#ifndef INCH_6
#define INCH_6 6
#endif
#ifndef XT2S0
#define XT2S0 0x40
#endif
#ifndef XT2S1
#define XT2S1 0x80
#endif
#ifndef UCB1RXBUF_
#define UCB1RXBUF_ 0x00DE
#endif
#ifndef UCB1RXBUF
#define UCB1RXBUF 0x00DE
#endif
#ifndef __MSP430_HAS_PORT2_R__
#define __MSP430_HAS_PORT2_R__ 
#endif
#ifndef __MSP430_HAS_PORT2_R_
#define __MSP430_HAS_PORT2_R_ 
#endif
#ifndef UCSSEL_UCLKI
#define UCSSEL_UCLKI UCSSEL_0
#endif
#ifndef __FINITE_MATH_ONLY__
#define __FINITE_MATH_ONLY__ 0
#endif
#ifndef __FINITE_MATH_ONLY_
#define __FINITE_MATH_ONLY_ 0
#endif
#ifndef CALDCO_12MHZ_
#define CALDCO_12MHZ_ 0x10FA
#endif
#ifndef CALDCO_12MHZ
#define CALDCO_12MHZ 0x10FA
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef __GNUC_PATCHLEVEL_
#define __GNUC_PATCHLEVEL_ 3
#endif
#ifndef DMAEN
#define DMAEN 0x0010
#endif
#ifndef TBCTL_
#define TBCTL_ 0x0180
#endif
#ifndef TBCTL
#define TBCTL 0x0180
#endif
#ifndef RESHI_
#define RESHI_ 0x013C
#endif
#ifndef RESHI
#define RESHI 0x013C
#endif
#ifndef DMA1CTL_
#define DMA1CTL_ 0x01DC
#endif
#ifndef DMA1CTL
#define DMA1CTL 0x01DC
#endif
#ifndef P4DIR_
#define P4DIR_ 0x001E
#endif
#ifndef P4DIR
#define P4DIR 0x001E
#endif
#ifndef __DEC64_MAX_EXP__
#define __DEC64_MAX_EXP__ 385
#endif
#ifndef __DEC64_MAX_EXP_
#define __DEC64_MAX_EXP_ 385
#endif
#ifndef XCAP0
#define XCAP0 0x04
#endif
#ifndef XCAP1
#define XCAP1 0x08
#endif
#ifndef P2CA0
#define P2CA0 0x04
#endif
#ifndef P2CA1
#define P2CA1 0x08
#endif
#ifndef P2CA2
#define P2CA2 0x10
#endif
#ifndef P2CA3
#define P2CA3 0x20
#endif
#ifndef P2CA4
#define P2CA4 0x40
#endif
#ifndef P7OUT_
#define P7OUT_ 0x003A
#endif
#ifndef P7OUT
#define P7OUT 0x003A
#endif
#ifndef RESERVED13_VECTOR
#define RESERVED13_VECTOR 26
#endif
#ifndef CALDCO_8MHZ_
#define CALDCO_8MHZ_ 0x10FC
#endif
#ifndef CALDCO_8MHZ
#define CALDCO_8MHZ 0x10FC
#endif
#ifndef DMAIE
#define DMAIE 0x0004
#endif
#ifndef ADC12CTL0_
#define ADC12CTL0_ 0x01A0
#endif
#ifndef ADC12CTL0
#define ADC12CTL0 0x01A0
#endif
#ifndef __SHRT_MAX__
#define __SHRT_MAX__ 32767
#endif
#ifndef __SHRT_MAX_
#define __SHRT_MAX_ 32767
#endif
#ifndef RESERVED4_VECTOR
#define RESERVED4_VECTOR 8
#endif
#ifndef __LDBL_MAX__
#define __LDBL_MAX__ 3.40282347e+38L
#endif
#ifndef __LDBL_MAX_
#define __LDBL_MAX_ 3.40282347e+38L
#endif
#ifndef __MSP430_HAS_DAC12__
#define __MSP430_HAS_DAC12__ 
#endif
#ifndef __MSP430_HAS_DAC12_
#define __MSP430_HAS_DAC12_ 
#endif
#ifndef P7SEL_
#define P7SEL_ 0x003E
#endif
#ifndef P7SEL
#define P7SEL 0x003E
#endif
#ifndef DIVA_DIV1
#define DIVA_DIV1 DIVA_0
#endif
#ifndef DIVA_DIV2
#define DIVA_DIV2 DIVA_1
#endif
#ifndef DIVA_DIV4
#define DIVA_DIV4 DIVA_2
#endif
#ifndef DIVA_DIV8
#define DIVA_DIV8 DIVA_3
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef SELM_XT2CLK
#define SELM_XT2CLK SELM_2
#endif
#ifndef __UINTMAX_TYPE__
#define __UINTMAX_TYPE__ long long unsigned int
#endif
#ifndef __UINTMAX_TYPE_
#define __UINTMAX_TYPE_ long long unsigned int
#endif
#ifndef P2REN_
#define P2REN_ 0x002F
#endif
#ifndef P2REN
#define P2REN 0x002F
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef __DEC32_EPSILON__
#define __DEC32_EPSILON__ 1E-6DF
#endif
#ifndef __DEC32_EPSILON_
#define __DEC32_EPSILON_ 1E-6DF
#endif
#ifndef TACCTL2_
#define TACCTL2_ TA0CCTL2_
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2_
#endif
#ifndef TAIV_CCR2
#define TAIV_CCR2 0x04
#endif
#ifndef CCTL0_
#define CCTL0_ TA0CCTL0_
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef MPYS_
#define MPYS_ 0x0132
#endif
#ifndef MPYS
#define MPYS 0x0132
#endif
#ifndef ADC12IFG_
#define ADC12IFG_ 0x01A4
#endif
#ifndef ADC12IFG
#define ADC12IFG 0x01A4
#endif
#ifndef __msp430_headers_usci_h__
#define __msp430_headers_usci_h__ 
#endif
#ifndef __msp430_headers_usci_h_
#define __msp430_headers_usci_h_ 
#endif
#ifndef UCA0BR0_
#define UCA0BR0_ 0x0062
#endif
#ifndef UCA0BR0
#define UCA0BR0 0x0062
#endif
#ifndef CCTL1_
#define CCTL1_ TA0CCTL1_
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef SVSFG
#define SVSFG 0x01
#endif
#ifndef __LDBL_MAX_EXP__
#define __LDBL_MAX_EXP__ 128
#endif
#ifndef __LDBL_MAX_EXP_
#define __LDBL_MAX_EXP_ 128
#endif
#ifndef UCA0BR1_
#define UCA0BR1_ 0x0063
#endif
#ifndef UCA0BR1
#define UCA0BR1 0x0063
#endif
#ifndef CCTL2_
#define CCTL2_ TA0CCTL2_
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef __WINT_MIN__
#define __WINT_MIN__ 0U
#endif
#ifndef __WINT_MIN_
#define __WINT_MIN_ 0U
#endif
#ifndef __MSP430_HAS_PORT1_R__
#define __MSP430_HAS_PORT1_R__ 
#endif
#ifndef __MSP430_HAS_PORT1_R_
#define __MSP430_HAS_PORT1_R_ 
#endif
#ifndef UCA1IRTCTL_
#define UCA1IRTCTL_ 0x00CE
#endif
#ifndef UCA1IRTCTL
#define UCA1IRTCTL 0x00CE
#endif
#ifndef TBIV_NONE
#define TBIV_NONE 0x00
#endif
#ifndef P3IN_
#define P3IN_ 0x0018
#endif
#ifndef P3IN
#define P3IN 0x0018
#endif
#ifndef DMA2SZ_
#define DMA2SZ_ 0x01F2
#endif
#ifndef DMA2SZ
#define DMA2SZ 0x01F2
#endif
#ifndef __SCHAR_MAX__
#define __SCHAR_MAX__ 127
#endif
#ifndef __SCHAR_MAX_
#define __SCHAR_MAX_ 127
#endif
#ifndef CAL_ADC_25T30
#define CAL_ADC_25T30 0x0006
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef P2IFG
#define P2IFG 0x002B
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef UCB1BR0_
#define UCB1BR0_ 0x00DA
#endif
#ifndef UCB1BR0
#define UCB1BR0 0x00DA
#endif
#ifndef TLV_CHECKSUM_
#define TLV_CHECKSUM_ 0x10C0
#endif
#ifndef TLV_CHECKSUM
#define TLV_CHECKSUM 0x10C0
#endif
#ifndef TACTL_
#define TACTL_ TA0CTL_
#endif
#ifndef TACTL
#define TACTL TA0CTL_
#endif
#ifndef CCR0_
#define CCR0_ TA0CCR0_
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef __DBL_DIG__
#define __DBL_DIG__ 6
#endif
#ifndef __DBL_DIG_
#define __DBL_DIG_ 6
#endif
#ifndef DMA0CTL_
#define DMA0CTL_ 0x01D0
#endif
#ifndef DMA0CTL
#define DMA0CTL 0x01D0
#endif
#ifndef UCB1BR1_
#define UCB1BR1_ 0x00DB
#endif
#ifndef UCB1BR1
#define UCB1BR1 0x00DB
#endif
#ifndef CCR1_
#define CCR1_ TA0CCR1_
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef P3DIR_
#define P3DIR_ 0x001A
#endif
#ifndef P3DIR
#define P3DIR 0x001A
#endif
#ifndef DCO0
#define DCO0 0x20
#endif
#ifndef DCO1
#define DCO1 0x40
#endif
#ifndef DCO2
#define DCO2 0x80
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0172
#endif
#ifndef TA0CCR0
#define TA0CCR0 0x0172
#endif
#ifndef DMA2DAL_
#define DMA2DAL_ 0x01EE
#endif
#ifndef DMA2DAL
#define DMA2DAL 0x01EE
#endif
#ifndef CCR2_
#define CCR2_ TA0CCR2_
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef P6OUT_
#define P6OUT_ 0x0035
#endif
#ifndef P6OUT
#define P6OUT 0x0035
#endif
#ifndef __SIZEOF_INT__
#define __SIZEOF_INT__ 2
#endif
#ifndef __SIZEOF_INT_
#define __SIZEOF_INT_ 2
#endif
#ifndef __SIZEOF_POINTER__
#define __SIZEOF_POINTER__ 2
#endif
#ifndef __SIZEOF_POINTER_
#define __SIZEOF_POINTER_ 2
#endif
#ifndef SVSON
#define SVSON 0x04
#endif
#ifndef SVSOP
#define SVSOP 0x02
#endif
#ifndef SELM0
#define SELM0 0x40
#endif
#ifndef __msp430_headers_dma_h
#define __msp430_headers_dma_h 
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef TBIFG
#define TBIFG 0x0001
#endif
#ifndef P6SEL_
#define P6SEL_ 0x0037
#endif
#ifndef P6SEL
#define P6SEL 0x0037
#endif
#ifndef UCB0I2COA_
#define UCB0I2COA_ 0x0118
#endif
#ifndef UCB0I2COA
#define UCB0I2COA 0x0118
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef __USER_LABEL_PREFIX_
#define __USER_LABEL_PREFIX_ 
#endif
#ifndef SHT1_DIV16
#define SHT1_DIV16 SHT1_2
#endif
#ifndef ADC12SSEL_ACLK
#define ADC12SSEL_ACLK ADC12SSEL_1
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef RESERVED9_VECTOR
#define RESERVED9_VECTOR 18
#endif
#ifndef SHT1_DIV32
#define SHT1_DIV32 SHT1_3
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef __STDC_HOSTED_
#define __STDC_HOSTED_ 1
#endif
#ifndef __LDBL_HAS_INFINITY__
#define __LDBL_HAS_INFINITY__ 1
#endif
#ifndef __LDBL_HAS_INFINITY_
#define __LDBL_HAS_INFINITY_ 1
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef __MSP430_HAS_USCI0__
#define __MSP430_HAS_USCI0__ 
#endif
#ifndef __MSP430_HAS_USCI0_
#define __MSP430_HAS_USCI0_ 
#endif
#ifndef P1REN_
#define P1REN_ 0x0027
#endif
#ifndef P1REN
#define P1REN 0x0027
#endif
#ifndef __msp430_headers_mpy_h
#define __msp430_headers_mpy_h 
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef DAC12_1CTL_
#define DAC12_1CTL_ 0x01C2
#endif
#ifndef DAC12_1CTL
#define DAC12_1CTL 0x01C2
#endif
#ifndef SHT1_DIV64
#define SHT1_DIV64 SHT1_4
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef RESLO_
#define RESLO_ 0x013A
#endif
#ifndef RESLO
#define RESLO 0x013A
#endif
#ifndef __FLT_EPSILON__
#define __FLT_EPSILON__ 1.19209290e-7F
#endif
#ifndef __FLT_EPSILON_
#define __FLT_EPSILON_ 1.19209290e-7F
#endif
#ifndef MERAS
#define MERAS 0x0004
#endif
#ifndef DMADSTINCR0
#define DMADSTINCR0 0x0400
#endif
#ifndef DMADSTINCR1
#define DMADSTINCR1 0x0800
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef __MSP430_
#define __MSP430_ 1
#endif
#ifndef ADC12MCTL_
#define ADC12MCTL_ 0x0080
#endif
#ifndef ADC12MCTL
#define ADC12MCTL 0x0080
#endif
#ifndef DMAABORT
#define DMAABORT 0x0002
#endif
#ifndef SHT1_DIV96
#define SHT1_DIV96 SHT1_5
#endif
#ifndef SHT0_DIV384
#define SHT0_DIV384 SHT0_9
#endif
#ifndef SREF_AVCC_AVSS
#define SREF_AVCC_AVSS SREF_0
#endif
#ifndef __LDBL_MIN__
#define __LDBL_MIN__ 1.17549435e-38L
#endif
#ifndef __LDBL_MIN_
#define __LDBL_MIN_ 1.17549435e-38L
#endif
#ifndef ADC12ON
#define ADC12ON 0x0010
#endif
#ifndef CAEX
#define CAEX 0x80
#endif
#ifndef __MSP430_HAS_BC2__
#define __MSP430_HAS_BC2__ 
#endif
#ifndef __MSP430_HAS_BC2_
#define __MSP430_HAS_BC2_ 
#endif
#ifndef P6IN_
#define P6IN_ 0x0034
#endif
#ifndef P6IN
#define P6IN 0x0034
#endif
#ifndef EMEX
#define EMEX 0x0020
#endif
#ifndef __DEC32_MAX__
#define __DEC32_MAX__ 9.999999E96DF
#endif
#ifndef __DEC32_MAX_
#define __DEC32_MAX_ 9.999999E96DF
#endif
#ifndef DMA0DA_
#define DMA0DA_ 0x01D6
#endif
#ifndef DMA0DA
#define DMA0DA 0x01D6
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef TLV_DCO_30_LEN_
#define TLV_DCO_30_LEN_ 0x10F7
#endif
#ifndef TLV_DCO_30_LEN
#define TLV_DCO_30_LEN 0x10F7
#endif
#ifndef ADC12DIV0
#define ADC12DIV0 0x0020
#endif
#ifndef ADC12DIV1
#define ADC12DIV1 0x0040
#endif
#ifndef ADC12DIV2
#define ADC12DIV2 0x0080
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef P1IFG
#define P1IFG 0x0023
#endif
#ifndef INCH_VEREF_PLUS
#define INCH_VEREF_PLUS 8
#endif
#ifndef DAC12ENC
#define DAC12ENC 0x0002
#endif
#ifndef UCB0BR0_
#define UCB0BR0_ 0x006A
#endif
#ifndef UCB0BR0
#define UCB0BR0 0x006A
#endif
#ifndef UCB0BR1_
#define UCB0BR1_ 0x006B
#endif
#ifndef UCB0BR1
#define UCB0BR1 0x006B
#endif
#ifndef CAIE
#define CAIE 0x02
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef P2DIR_
#define P2DIR_ 0x002A
#endif
#ifndef P2DIR
#define P2DIR 0x002A
#endif
#ifndef __SIZEOF_LONG__
#define __SIZEOF_LONG__ 4
#endif
#ifndef __SIZEOF_LONG_
#define __SIZEOF_LONG_ 4
#endif
#ifndef DAC12LSEL0
#define DAC12LSEL0 0x0400
#endif
#ifndef DAC12LSEL1
#define DAC12LSEL1 0x0800
#endif
#ifndef DMA1DAL_
#define DMA1DAL_ 0x01E2
#endif
#ifndef DMA1DAL
#define DMA1DAL 0x01E2
#endif
#ifndef VLDON
#define VLDON 0x10
#endif
#ifndef P5OUT_
#define P5OUT_ 0x0031
#endif
#ifndef P5OUT
#define P5OUT 0x0031
#endif
#ifndef USCIAB1TX_VECTOR
#define USCIAB1TX_VECTOR 32
#endif
#ifndef SHS_ADC12SC
#define SHS_ADC12SC SHS_0
#endif
#ifndef __DECIMAL_DIG__
#define __DECIMAL_DIG__ 9
#endif
#ifndef __DECIMAL_DIG_
#define __DECIMAL_DIG_ 9
#endif
#ifndef TBIV_
#define TBIV_ 0x011E
#endif
#ifndef TBIV
#define TBIV 0x011E
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef FWKEY
#define FWKEY 0xA500
#endif
#ifndef __msp430_headers_adc12_h
#define __msp430_headers_adc12_h 
#endif
#ifndef UCA1RXBUF_
#define UCA1RXBUF_ 0x00D6
#endif
#ifndef UCA1RXBUF
#define UCA1RXBUF 0x00D6
#endif
#ifndef TBIV_OVERFLOW
#define TBIV_OVERFLOW 0x0E
#endif
#ifndef P5SEL_
#define P5SEL_ 0x0033
#endif
#ifndef P5SEL
#define P5SEL 0x0033
#endif
#ifndef KEYV
#define KEYV 0x0002
#endif
#ifndef UC1IFG_
#define UC1IFG_ 0x0007
#endif
#ifndef UC1IFG
#define UC1IFG 0x0007
#endif
#ifndef CAON
#define CAON 0x08
#endif
#ifndef __LDBL_HAS_QUIET_NAN__
#define __LDBL_HAS_QUIET_NAN__ 1
#endif
#ifndef __LDBL_HAS_QUIET_NAN_
#define __LDBL_HAS_QUIET_NAN_ 1
#endif
#ifndef LOCK
#define LOCK 0x0010
#endif
#ifndef __msp430_headers_svs_h
#define __msp430_headers_svs_h 
#endif
#ifndef UCB1TXBUF_
#define UCB1TXBUF_ 0x00DF
#endif
#ifndef UCB1TXBUF
#define UCB1TXBUF 0x00DF
#endif
#ifndef ADC12MCTL11_
#define ADC12MCTL11_ 0x008B
#endif
#ifndef ADC12MCTL11
#define ADC12MCTL11 0x008B
#endif
#ifndef ADC12MCTL12_
#define ADC12MCTL12_ 0x008C
#endif
#ifndef ADC12MCTL12
#define ADC12MCTL12 0x008C
#endif
#ifndef DIVM_DIV1
#define DIVM_DIV1 DIVM_0
#endif
#ifndef DIVM_DIV2
#define DIVM_DIV2 DIVM_1
#endif
#ifndef DIVM_DIV4
#define DIVM_DIV4 DIVM_2
#endif
#ifndef DIVM_DIV8
#define DIVM_DIV8 DIVM_3
#endif
#ifndef FN2
#define FN2 0x0004
#endif
#ifndef __GNUC__
#define __GNUC__ 4
#endif
#ifndef __GNUC_
#define __GNUC_ 4
#endif
#ifndef ADC12MCTL13_
#define ADC12MCTL13_ 0x008D
#endif
#ifndef ADC12MCTL13
#define ADC12MCTL13 0x008D
#endif
#ifndef DAC12_0CTL_
#define DAC12_0CTL_ 0x01C0
#endif
#ifndef DAC12_0CTL
#define DAC12_0CTL 0x01C0
#endif
#ifndef UCB0I2CSA_
#define UCB0I2CSA_ 0x011A
#endif
#ifndef UCB0I2CSA
#define UCB0I2CSA 0x011A
#endif
#ifndef ADC12MCTL14_
#define ADC12MCTL14_ 0x008E
#endif
#ifndef ADC12MCTL14
#define ADC12MCTL14 0x008E
#endif
#ifndef ROUNDROBIN
#define ROUNDROBIN 0x0002
#endif
#ifndef RESERVED12_VECTOR
#define RESERVED12_VECTOR 24
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 38
#endif
#ifndef __FLT_HAS_DENORM__
#define __FLT_HAS_DENORM__ 1
#endif
#ifndef __FLT_HAS_DENORM_
#define __FLT_HAS_DENORM_ 1
#endif
#ifndef __SIZEOF_LONG_DOUBLE__
#define __SIZEOF_LONG_DOUBLE__ 4
#endif
#ifndef __SIZEOF_LONG_DOUBLE_
#define __SIZEOF_LONG_DOUBLE_ 4
#endif
#ifndef CSTARTADD0
#define CSTARTADD0 0x1000
#endif
#ifndef CSTARTADD1
#define CSTARTADD1 0x2000
#endif
#ifndef CSTARTADD2
#define CSTARTADD2 0x4000
#endif
#ifndef CSTARTADD3
#define CSTARTADD3 0x8000
#endif
#ifndef TBSSEL_TBCLK
#define TBSSEL_TBCLK TBSSEL_0
#endif
#ifndef FSSEL_0
#define FSSEL_0 0x0000
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef ADC12MCTL15_
#define ADC12MCTL15_ 0x008F
#endif
#ifndef ADC12MCTL15
#define ADC12MCTL15 0x008F
#endif
#ifndef TBSSEL_SMCLK
#define TBSSEL_SMCLK TBSSEL_2
#endif
#ifndef ADC12MEM10_
#define ADC12MEM10_ 0x0154
#endif
#ifndef ADC12MEM10
#define ADC12MEM10 0x0154
#endif
#ifndef UC0IFG
#define UC0IFG IFG2
#endif
#ifndef RESERVED3_VECTOR
#define RESERVED3_VECTOR 6
#endif
#ifndef ADC12MEM11_
#define ADC12MEM11_ 0x0156
#endif
#ifndef ADC12MEM11
#define ADC12MEM11 0x0156
#endif
#ifndef __BIGGEST_ALIGNMENT__
#define __BIGGEST_ALIGNMENT__ 2
#endif
#ifndef __BIGGEST_ALIGNMENT_
#define __BIGGEST_ALIGNMENT_ 2
#endif
#ifndef UCA1IRRCTL_
#define UCA1IRRCTL_ 0x00CF
#endif
#ifndef UCA1IRRCTL
#define UCA1IRRCTL 0x00CF
#endif
#ifndef ADC12MEM12_
#define ADC12MEM12_ 0x0158
#endif
#ifndef ADC12MEM12
#define ADC12MEM12 0x0158
#endif
#ifndef DAC12IFG
#define DAC12IFG 0x0004
#endif
#ifndef ADC12MEM13_
#define ADC12MEM13_ 0x015A
#endif
#ifndef ADC12MEM13
#define ADC12MEM13 0x015A
#endif
#ifndef ADC12MEM14_
#define ADC12MEM14_ 0x015C
#endif
#ifndef ADC12MEM14
#define ADC12MEM14 0x015C
#endif
#ifndef ADC12OVIE
#define ADC12OVIE 0x0008
#endif
#ifndef SHT0_DIV768
#define SHT0_DIV768 SHT0_11
#endif
#ifndef ADC12MEM15_
#define ADC12MEM15_ 0x015E
#endif
#ifndef ADC12MEM15
#define ADC12MEM15 0x015E
#endif
#ifndef __DBL_HAS_INFINITY__
#define __DBL_HAS_INFINITY__ 1
#endif
#ifndef __DBL_HAS_INFINITY_
#define __DBL_HAS_INFINITY_ 1
#endif
#ifndef TACCR0_
#define TACCR0_ TA0CCR0_
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0_
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef FAIL
#define FAIL 0x0080
#endif
#ifndef TAIV
#define TAIV TA0IV
#endif
#ifndef ADC12IE_
#define ADC12IE_ 0x01A6
#endif
#ifndef ADC12IE
#define ADC12IE 0x01A6
#endif
#ifndef TACCR1_
#define TACCR1_ TA0CCR1_
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1_
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef P1DIR
#define P1DIR 0x0022
#endif
#ifndef ADC12MEM_
#define ADC12MEM_ 0x0140
#endif
#ifndef ADC12MEM
#define ADC12MEM 0x0140
#endif
#ifndef DMA0DAL_
#define DMA0DAL_ 0x01D6
#endif
#ifndef DMA0DAL
#define DMA0DAL 0x01D6
#endif
#ifndef BLKWRT
#define BLKWRT 0x0080
#endif
#ifndef TACCR2_
#define TACCR2_ TA0CCR2_
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2_
#endif
#ifndef P4OUT_
#define P4OUT_ 0x001D
#endif
#ifndef P4OUT
#define P4OUT 0x001D
#endif
#ifndef UCA0STAT_
#define UCA0STAT_ 0x0065
#endif
#ifndef UCA0STAT
#define UCA0STAT 0x0065
#endif
#ifndef SHT00
#define SHT00 0x0100
#endif
#ifndef SHT01
#define SHT01 0x0200
#endif
#ifndef SHT02
#define SHT02 0x0400
#endif
#ifndef SHT03
#define SHT03 0x0800
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef __msp430_headers_timerb_h__
#define __msp430_headers_timerb_h__ 
#endif
#ifndef __msp430_headers_timerb_h_
#define __msp430_headers_timerb_h_ 
#endif
#ifndef UCA1ABCTL_
#define UCA1ABCTL_ 0x00CD
#endif
#ifndef UCA1ABCTL
#define UCA1ABCTL 0x00CD
#endif
#ifndef SHT10
#define SHT10 0x1000
#endif
#ifndef SHT11
#define SHT11 0x2000
#endif
#ifndef SHT12
#define SHT12 0x4000
#endif
#ifndef SHT13
#define SHT13 0x8000
#endif
#ifndef DAC12_VECTOR
#define DAC12_VECTOR 28
#endif
#ifndef RSEL0
#define RSEL0 0x01
#endif
#ifndef RSEL1
#define RSEL1 0x02
#endif
#ifndef RSEL2
#define RSEL2 0x04
#endif
#ifndef RSEL3
#define RSEL3 0x08
#endif
#ifndef UCA0IRTCTL_
#define UCA0IRTCTL_ 0x005E
#endif
#ifndef UCA0IRTCTL
#define UCA0IRTCTL 0x005E
#endif
#ifndef UCSSEL_SMCLK
#define UCSSEL_SMCLK UCSSEL_2
#endif
#ifndef P4SEL_
#define P4SEL_ 0x001F
#endif
#ifndef P4SEL
#define P4SEL 0x001F
#endif
#ifndef ADC12MCTL0_
#define ADC12MCTL0_ ADC12MCTL_
#endif
#ifndef ADC12MCTL0
#define ADC12MCTL0 ADC12MCTL_
#endif
#ifndef TAIV_NONE
#define TAIV_NONE 0x00
#endif
#ifndef DMASRCINCR0
#define DMASRCINCR0 0x0100
#endif
#ifndef DMASRCINCR1
#define DMASRCINCR1 0x0200
#endif
#ifndef ADC12MCTL1_
#define ADC12MCTL1_ 0x0081
#endif
#ifndef ADC12MCTL1
#define ADC12MCTL1 0x0081
#endif
#ifndef __LDBL_HAS_DENORM__
#define __LDBL_HAS_DENORM__ 1
#endif
#ifndef __LDBL_HAS_DENORM_
#define __LDBL_HAS_DENORM_ 1
#endif
#ifndef ADC12MCTL2_
#define ADC12MCTL2_ 0x0082
#endif
#ifndef ADC12MCTL2
#define ADC12MCTL2 0x0082
#endif
#ifndef DMA0SA_
#define DMA0SA_ 0x01D2
#endif
#ifndef DMA0SA
#define DMA0SA 0x01D2
#endif
#ifndef __DEC128_MAX__
#define __DEC128_MAX__ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __DEC128_MAX_
#define __DEC128_MAX_ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef __USING_SJLJ_EXCEPTIONS_
#define __USING_SJLJ_EXCEPTIONS_ 1
#endif
#ifndef ADC12MCTL3_
#define ADC12MCTL3_ 0x0083
#endif
#ifndef ADC12MCTL3
#define ADC12MCTL3 0x0083
#endif
#ifndef __DEC32_MIN__
#define __DEC32_MIN__ 1E-95DF
#endif
#ifndef __DEC32_MIN_
#define __DEC32_MIN_ 1E-95DF
#endif
#ifndef SVSCTL_
