jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x261x.cpp
#define SVSCTL_ 0x0056
#endif
#ifndef SVSCTL
#define SVSCTL 0x0056
#endif
#ifndef ADC12MCTL4_
#define ADC12MCTL4_ 0x0084
#endif
#ifndef ADC12MCTL4
#define ADC12MCTL4 0x0084
#endif
#ifndef DMALEVEL
#define DMALEVEL 0x0020
#endif
#ifndef TAR_
#define TAR_ TA0R_
#endif
#ifndef TAR
#define TAR TA0R_
#endif
#ifndef DAC12SREF0
#define DAC12SREF0 0x2000
#endif
#ifndef DAC12SREF1
#define DAC12SREF1 0x4000
#endif
#ifndef __DBL_MAX_EXP__
#define __DBL_MAX_EXP__ 128
#endif
#ifndef __DBL_MAX_EXP_
#define __DBL_MAX_EXP_ 128
#endif
#ifndef EEIEX
#define EEIEX 0x0010
#endif
#ifndef ADC12MCTL5_
#define ADC12MCTL5_ 0x0085
#endif
#ifndef ADC12MCTL5
#define ADC12MCTL5 0x0085
#endif
#ifndef __DEC128_EPSILON__
#define __DEC128_EPSILON__ 1E-33DL
#endif
#ifndef __DEC128_EPSILON_
#define __DEC128_EPSILON_ 1E-33DL
#endif
#ifndef ISSH
#define ISSH 0x0100
#endif
#ifndef ADC12MCTL6_
#define ADC12MCTL6_ 0x0086
#endif
#ifndef ADC12MCTL6
#define ADC12MCTL6 0x0086
#endif
#ifndef DAC12DF
#define DAC12DF 0x0010
#endif
#ifndef CALDCO_1MHZ_
#define CALDCO_1MHZ_ 0x10FE
#endif
#ifndef CALDCO_1MHZ
#define CALDCO_1MHZ 0x10FE
#endif
#ifndef __PTRDIFF_MAX__
#define __PTRDIFF_MAX__ 2147483647L
#endif
#ifndef __PTRDIFF_MAX_
#define __PTRDIFF_MAX_ 2147483647L
#endif
#ifndef ADC12MCTL7_
#define ADC12MCTL7_ 0x0087
#endif
#ifndef ADC12MCTL7
#define ADC12MCTL7 0x0087
#endif
#ifndef UCA0CTL0_
#define UCA0CTL0_ 0x0060
#endif
#ifndef UCA0CTL0
#define UCA0CTL0 0x0060
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef __MSP430_HAS_WDT_
#define __MSP430_HAS_WDT_ 
#endif
#ifndef TA0CTL_
#define TA0CTL_ 0x0160
#endif
#ifndef TA0CTL
#define TA0CTL 0x0160
#endif
#ifndef ADC12MCTL8_
#define ADC12MCTL8_ 0x0088
#endif
#ifndef ADC12MCTL8
#define ADC12MCTL8 0x0088
#endif
#ifndef UCA0CTL1_
#define UCA0CTL1_ 0x0061
#endif
#ifndef UCA0CTL1
#define UCA0CTL1 0x0061
#endif
#ifndef ADC12MCTL9_
#define ADC12MCTL9_ 0x0089
#endif
#ifndef ADC12MCTL9
#define ADC12MCTL9 0x0089
#endif
#ifndef __LONG_LONG_MAX__
#define __LONG_LONG_MAX__ 9223372036854775807LL
#endif
#ifndef __LONG_LONG_MAX_
#define __LONG_LONG_MAX_ 9223372036854775807LL
#endif
#ifndef RESERVED8_VECTOR
#define RESERVED8_VECTOR 16
#endif
#ifndef TBSSEL_INCLK
#define TBSSEL_INCLK TBSSEL_3
#endif
#ifndef __SIZEOF_SIZE_T__
#define __SIZEOF_SIZE_T__ 2
#endif
#ifndef __SIZEOF_SIZE_T_
#define __SIZEOF_SIZE_T_ 2
#endif
#ifndef DAC12IE
#define DAC12IE 0x0008
#endif
#ifndef DAC12IR
#define DAC12IR 0x0100
#endif
#ifndef ADC12SSEL0
#define ADC12SSEL0 0x0008
#endif
#ifndef ADC12SSEL1
#define ADC12SSEL1 0x0010
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef MSP430_NO_HWMUL
#define MSP430_NO_HWMUL 1
#endif
#ifndef ADC12IV_
#define ADC12IV_ 0x01A8
#endif
#ifndef ADC12IV
#define ADC12IV 0x01A8
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef __SIZEOF_WINT_T__
#define __SIZEOF_WINT_T__ 2
#endif
#ifndef __SIZEOF_WINT_T_
#define __SIZEOF_WINT_T_ 2
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef USCIAB0TX_VECTOR
#define USCIAB0TX_VECTOR 44
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef IE2
#define IE2 0x0001
#endif
#ifndef DAC12_1DAT_
#define DAC12_1DAT_ 0x01CA
#endif
#ifndef DAC12_1DAT
#define DAC12_1DAT 0x01CA
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef P3OUT_
#define P3OUT_ 0x0019
#endif
#ifndef P3OUT
#define P3OUT 0x0019
#endif
#ifndef RESERVED20_VECTOR
#define RESERVED20_VECTOR 40
#endif
#ifndef DMASRCBYTE
#define DMASRCBYTE 0x0040
#endif
#ifndef DIVA0
#define DIVA0 0x10
#endif
#ifndef DIVA1
#define DIVA1 0x20
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 1002
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef __msp430_headers_timera_h_
#define __msp430_headers_timera_h_ 
#endif
#ifndef SHS_TACCR1
#define SHS_TACCR1 SHS_1
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef P1IE
#define P1IE 0x0025
#endif
#ifndef P3SEL_
#define P3SEL_ 0x001B
#endif
#ifndef P3SEL
#define P3SEL 0x001B
#endif
#ifndef TIMERB1_VECTOR
#define TIMERB1_VECTOR 56
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef TA0IV
#define TA0IV 0x012E
#endif
#ifndef DAC12CALON
#define DAC12CALON 0x0200
#endif
#ifndef ADC12MEM
#define ADC12MEM ADC12MEM_
#endif
#ifndef TBCCR1_
#define TBCCR1_ 0x0194
#endif
#ifndef TBCCR1
#define TBCCR1 0x0194
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef CACTL1_
#define CACTL1_ 0x0059
#endif
#ifndef CACTL1
#define CACTL1 0x0059
#endif
#ifndef TBCCR2_
#define TBCCR2_ 0x0196
#endif
#ifndef TBCCR2
#define TBCCR2 0x0196
#endif
#ifndef TBCCTL0_
#define TBCCTL0_ 0x0182
#endif
#ifndef TBCCTL0
#define TBCCTL0 0x0182
#endif
#ifndef TBCCR3_
#define TBCCR3_ 0x0198
#endif
#ifndef TBCCR3
#define TBCCR3 0x0198
#endif
#ifndef SREF_AVCC_VEREF
#define SREF_AVCC_VEREF SREF_4
#endif
#ifndef __MSP430_IVCNT__
#define __MSP430_IVCNT__ 16
#endif
#ifndef __MSP430_IVCNT_
#define __MSP430_IVCNT_ 16
#endif
#ifndef TBCCTL1_
#define TBCCTL1_ 0x0184
#endif
#ifndef TBCCTL1
#define TBCCTL1 0x0184
#endif
#ifndef TBCCR4_
#define TBCCR4_ 0x019A
#endif
#ifndef TBCCR4
#define TBCCR4 0x019A
#endif
#ifndef TBCCTL2_
#define TBCCTL2_ 0x0186
#endif
#ifndef TBCCTL2
#define TBCCTL2 0x0186
#endif
#ifndef TBCCR5_
#define TBCCR5_ 0x019C
#endif
#ifndef TBCCR5
#define TBCCR5 0x019C
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef TBCCTL3_
#define TBCCTL3_ 0x0188
#endif
#ifndef TBCCTL3
#define TBCCTL3 0x0188
#endif
#ifndef TBCCR6_
#define TBCCR6_ 0x019E
#endif
#ifndef TBCCR6
#define TBCCR6 0x019E
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef FCTL2
#define FCTL2 0x012A
#endif
#ifndef CALBC1_1MHZ_
#define CALBC1_1MHZ_ 0x10FF
#endif
#ifndef CALBC1_1MHZ
#define CALBC1_1MHZ 0x10FF
#endif
#ifndef __msp430_headers_dac12_h
#define __msp430_headers_dac12_h 
#endif
#ifndef TBCCTL4_
#define TBCCTL4_ 0x018A
#endif
#ifndef TBCCTL4
#define TBCCTL4 0x018A
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef FCTL3
#define FCTL3 0x012C
#endif
#ifndef TBCCTL5_
#define TBCCTL5_ 0x018C
#endif
#ifndef TBCCTL5
#define TBCCTL5 0x018C
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef P1IN
#define P1IN 0x0020
#endif
#ifndef CAL_BC1_12MHZ
#define CAL_BC1_12MHZ 0x0003
#endif
#ifndef DMA0SZ_
#define DMA0SZ_ 0x01DA
#endif
#ifndef DMA0SZ
#define DMA0SZ 0x01DA
#endif
#ifndef TBCCTL6_
#define TBCCTL6_ 0x018E
#endif
#ifndef TBCCTL6
#define TBCCTL6 0x018E
#endif
#ifndef DMAREQ
#define DMAREQ 0x0001
#endif
#ifndef DIVM0
#define DIVM0 0x10
#endif
#ifndef DIVM1
#define DIVM1 0x20
#endif
#ifndef UCA1TXBUF_
#define UCA1TXBUF_ 0x00D7
#endif
#ifndef UCA1TXBUF
#define UCA1TXBUF 0x00D7
#endif
#ifndef DCOCTL_
#define DCOCTL_ 0x0056
#endif
#ifndef DCOCTL
#define DCOCTL 0x0056
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef UCA1CTL0_
#define UCA1CTL0_ 0x00D0
#endif
#ifndef UCA1CTL0
#define UCA1CTL0 0x00D0
#endif
#ifndef DMA1TSEL3
#define DMA1TSEL3 0x0080
#endif
#ifndef __DEC128_MIN__
#define __DEC128_MIN__ 1E-6143DL
#endif
#ifndef __DEC128_MIN_
#define __DEC128_MIN_ 1E-6143DL
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef __REGISTER_PREFIX_
#define __REGISTER_PREFIX_ 
#endif
#ifndef DMAONFETCH
#define DMAONFETCH 0x0004
#endif
#ifndef __DBL_HAS_DENORM__
#define __DBL_HAS_DENORM__ 1
#endif
#ifndef __DBL_HAS_DENORM_
#define __DBL_HAS_DENORM_ 1
#endif
#ifndef UCA1CTL1_
#define UCA1CTL1_ 0x00D1
#endif
#ifndef UCA1CTL1
#define UCA1CTL1 0x00D1
#endif
#ifndef DAC12_0DAT_
#define DAC12_0DAT_ 0x01C8
#endif
#ifndef DAC12_0DAT
#define DAC12_0DAT 0x01C8
#endif
#ifndef SHT1_DIV128
#define SHT1_DIV128 SHT1_6
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef P2OUT
#define P2OUT 0x0029
#endif
#ifndef RESERVED11_VECTOR
#define RESERVED11_VECTOR 22
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 36
#endif
#ifndef ADC12SSEL_SMCLK
#define ADC12SSEL_SMCLK ADC12SSEL_3
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef __MSP430_HAS_TA3__
#define __MSP430_HAS_TA3__ 
#endif
#ifndef __MSP430_HAS_TA3_
#define __MSP430_HAS_TA3_ 
#endif
#ifndef DIVS0
#define DIVS0 0x02
#endif
#ifndef DIVS1
#define DIVS1 0x04
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef __NO_INLINE_
#define __NO_INLINE_ 1
#endif
#ifndef RESERVED2_VECTOR
#define RESERVED2_VECTOR 4
#endif
#ifndef DMA0TSEL0
#define DMA0TSEL0 0x0001
#endif
#ifndef DMA0TSEL1
#define DMA0TSEL1 0x0002
#endif
#ifndef DMA0TSEL2
#define DMA0TSEL2 0x0004
#endif
#ifndef DMA0TSEL3
#define DMA0TSEL3 0x0008
#endif
#ifndef __MSP430_HAS_USCI_AB0__
#define __MSP430_HAS_USCI_AB0__ 
#endif
#ifndef __MSP430_HAS_USCI_AB0_
#define __MSP430_HAS_USCI_AB0_ 
#endif
#ifndef ADC12SSEL_MCLK
#define ADC12SSEL_MCLK ADC12SSEL_2
#endif
#ifndef __MSP430_HAS_USCI1__
#define __MSP430_HAS_USCI1__ 
#endif
#ifndef __MSP430_HAS_USCI1_
#define __MSP430_HAS_USCI1_ 
#endif
#ifndef SELM1
#define SELM1 0x80
#endif
#ifndef UCA0IRRCTL_
#define UCA0IRRCTL_ 0x005F
#endif
#ifndef UCA0IRRCTL
#define UCA0IRRCTL 0x005F
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef P2SEL
#define P2SEL 0x002E
#endif
#ifndef __FLT_MANT_DIG__
#define __FLT_MANT_DIG__ 24
#endif
#ifndef __FLT_MANT_DIG_
#define __FLT_MANT_DIG_ 24
#endif
#ifndef DMA_VECTOR
#define DMA_VECTOR 30
#endif
#ifndef __VERSION__
#define __VERSION__ "4.5.3"
#endif
#ifndef __VERSION_
#define __VERSION_ "4.5.3"
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef WDTCTL
#define WDTCTL 0x0120
#endif
#ifndef CAL_BC1_1MHZ
#define CAL_BC1_1MHZ 0x0007
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef SHT1_DIV192
#define SHT1_DIV192 SHT1_7
#endif
#ifndef LFXT1OF
#define LFXT1OF 0x01
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef TA0CCTL0
#define TA0CCTL0 0x0162
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef TBSSEL0
#define TBSSEL0 0x0100
#endif
#ifndef TBSSEL1
#define TBSSEL1 0x0200
#endif
#ifndef TBSSEL2
#define TBSSEL2 0x0400
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef TA0CCTL1
#define TA0CCTL1 0x0164
#endif
#ifndef CAREF_0
#define CAREF_0 0x00
#endif
#ifndef CAREF_1
#define CAREF_1 0x10
#endif
#ifndef CAREF_2
#define CAREF_2 0x20
#endif
#ifndef CAREF_3
#define CAREF_3 0x30
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef __IOMACROS_H
#define __IOMACROS_H 
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0166
#endif
#ifndef TA0CCTL2
#define TA0CCTL2 0x0166
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef CAL_ADC_15VREF_FACTOR
#define CAL_ADC_15VREF_FACTOR 0x0002
#endif
#ifndef SHT1_DIV768
#define SHT1_DIV768 SHT1_11
#endif
#ifndef LFXT1S0
#define LFXT1S0 0x10
#endif
#ifndef LFXT1S1
#define LFXT1S1 0x20
#endif
#ifndef SHT1_DIV1024
#define SHT1_DIV1024 SHT1_12
#endif
#ifndef P4IN_
#define P4IN_ 0x001C
#endif
#ifndef P4IN
#define P4IN 0x001C
#endif
#ifndef VLDOFF
#define VLDOFF 0x00
#endif
#ifndef CARSEL
#define CARSEL 0x40
#endif
#ifndef SREF_VREF_AVSS
#define SREF_VREF_AVSS SREF_1
#endif
#ifndef MOD4
#define MOD4 0x10
#endif
#ifndef ADC12_VECTOR
#define ADC12_VECTOR 42
#endif
#ifndef ADC12TOVIE
#define ADC12TOVIE 0x0004
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2
#endif
#ifndef INCH_10
#define INCH_10 10
#endif
#ifndef INCH_11
#define INCH_11 11
#endif
#ifndef INCH_12
#define INCH_12 12
#endif
#ifndef INCH_13
#define INCH_13 13
#endif
#ifndef INCH_14
#define INCH_14 14
#endif
#ifndef INCH_15
#define INCH_15 15
#endif
#ifndef SUMEXT_
#define SUMEXT_ 0x013E
#endif
#ifndef SUMEXT
#define SUMEXT 0x013E
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef P1OUT
#define P1OUT 0x0021
#endif
#ifndef DMACTL0_
#define DMACTL0_ 0x0122
#endif
#ifndef DMACTL0
#define DMACTL0 0x0122
#endif
#ifndef OP2_
#define OP2_ 0x0138
#endif
#ifndef OP2
#define OP2 0x0138
#endif
#ifndef __DEC64_EPSILON__
#define __DEC64_EPSILON__ 1E-15DD
#endif
#ifndef __DEC64_EPSILON_
#define __DEC64_EPSILON_ 1E-15DD
#endif
#ifndef DMACTL1_
#define DMACTL1_ 0x0124
#endif
#ifndef DMACTL1
#define DMACTL1 0x0124
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef CAF
#define CAF 0x02
#endif
#ifndef CALBC1_16MHZ_
#define CALBC1_16MHZ_ 0x10F9
#endif
#ifndef CALBC1_16MHZ
#define CALBC1_16MHZ 0x10F9
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef P1SEL
#define P1SEL 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef CAIFG
#define CAIFG 0x01
#endif
#ifndef SHT1_DIV512
#define SHT1_DIV512 SHT1_10
#endif
#ifndef ADC12SSEL_ADC12OSC
#define ADC12SSEL_ADC12OSC ADC12SSEL_0
#endif
#ifndef UCB0I2CIE_
#define UCB0I2CIE_ 0x006C
#endif
#ifndef UCB0I2CIE
#define UCB0I2CIE 0x006C
#endif
#ifndef RESERVED7_VECTOR
#define RESERVED7_VECTOR 14
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef __SIZE_TYPE_
#define __SIZE_TYPE_ unsigned int
#endif
#ifndef TBCLR
#define TBCLR 0x0004
#endif
#ifndef DMA1TSEL0
#define DMA1TSEL0 0x0010
#endif
#ifndef DMA1TSEL1
#define DMA1TSEL1 0x0020
#endif
#ifndef DMA1TSEL2
#define DMA1TSEL2 0x0040
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef ADC12SC
#define ADC12SC 0x0001
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef TBCCR0_
#define TBCCR0_ 0x0192
#endif
#ifndef TBCCR0
#define TBCCR0 0x0192
#endif
#ifndef UCB0RXBUF_
#define UCB0RXBUF_ 0x006E
#endif
#ifndef UCB0RXBUF
#define UCB0RXBUF 0x006E
#endif
#ifndef P7IN_
#define P7IN_ 0x0038
#endif
#ifndef P7IN
#define P7IN 0x0038
#endif
#ifndef TBIE
#define TBIE 0x0002
#endif
#ifndef SELM_LFXTCLK
#define SELM_LFXTCLK SELM_3
#endif
#ifndef __FLT_RADIX__
#define __FLT_RADIX__ 2
#endif
#ifndef __FLT_RADIX_
#define __FLT_RADIX_ 2
#endif
#ifndef DMA1DA_
#define DMA1DA_ 0x01E2
#endif
#ifndef DMA1DA
#define DMA1DA 0x01E2
#endif
#ifndef TIMERB0_VECTOR
#define TIMERB0_VECTOR 58
#endif
#ifndef __LDBL_EPSILON__
#define __LDBL_EPSILON__ 1.19209290e-7L
#endif
#ifndef __LDBL_EPSILON_
#define __LDBL_EPSILON_ 1.19209290e-7L
#endif
#ifndef ADC12MEM2_
#define ADC12MEM2_ 0x0144
#endif
#ifndef ADC12MEM2
#define ADC12MEM2 0x0144
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef INCH_A1
#define INCH_A1 1
#endif
#ifndef INCH_A2
#define INCH_A2 2
#endif
#ifndef INCH_A3
#define INCH_A3 3
#endif
#ifndef INCH_A4
#define INCH_A4 4
#endif
#ifndef INCH_A5
#define INCH_A5 5
#endif
#ifndef INCH_A6
#define INCH_A6 6
#endif
#ifndef SHP
#define SHP 0x0200
#endif
#ifndef DMA1SAL_
#define DMA1SAL_ 0x01DE
#endif
#ifndef DMA1SAL
#define DMA1SAL 0x01DE
#endif
#ifndef ACCVIFG
#define ACCVIFG 0x0004
#endif
#ifndef __msp430_headers_clock_h
#define __msp430_headers_clock_h 
#endif
#ifndef UCSSEL_ACLK
#define UCSSEL_ACLK UCSSEL_1
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef CAL_ADC_15T30
#define CAL_ADC_15T30 0x0003
#endif
#ifndef __SIZEOF_PTRDIFF_T__
#define __SIZEOF_PTRDIFF_T__ 4
#endif
#ifndef __SIZEOF_PTRDIFF_T_
#define __SIZEOF_PTRDIFF_T_ 4
#endif
#ifndef FXKEY
#define FXKEY 0x3300
#endif
#ifndef REFON
#define REFON 0x0020
#endif
#ifndef PORON
#define PORON 0x08
#endif
#ifndef TBR_
#define TBR_ 0x0190
#endif
#ifndef TBR
#define TBR 0x0190
#endif
#ifndef CAL_DCO_12MHZ
#define CAL_DCO_12MHZ 0x0002
#endif
#ifndef MOD0
#define MOD0 0x01
#endif
#ifndef MOD1
#define MOD1 0x02
#endif
#ifndef MOD2
#define MOD2 0x04
#endif
#ifndef MOD3
#define MOD3 0x08
#endif
#ifndef __DEC32_SUBNORMAL_MIN__
#define __DEC32_SUBNORMAL_MIN__ 0.000001E-95DF
#endif
#ifndef __DEC32_SUBNORMAL_MIN_
#define __DEC32_SUBNORMAL_MIN_ 0.000001E-95DF
#endif
#ifndef SREF_VEREF_VEREF
#define SREF_VEREF_VEREF SREF_6
#endif
#ifndef UC0IE
#define UC0IE IE2
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 60
#endif
#ifndef TAIV_CCR1
#define TAIV_CCR1 0x02
#endif
#ifndef __MSP430_HAS_PORT8_R__
#define __MSP430_HAS_PORT8_R__ 
#endif
#ifndef __MSP430_HAS_PORT8_R_
#define __MSP430_HAS_PORT8_R_ 
#endif
#ifndef SREF_VREF_VEREF
#define SREF_VREF_VEREF SREF_5
#endif
#ifndef __MSP430F110__
#define __MSP430F110__ 1
#endif
#ifndef __MSP430F110_
#define __MSP430F110_ 1
#endif
#ifndef UC1IE_
#define UC1IE_ 0x0006
#endif
#ifndef UC1IE
#define UC1IE 0x0006
#endif
#ifndef CONSEQ_REPEAT_SEQUENCE
#define CONSEQ_REPEAT_SEQUENCE CONSEQ_3
#endif
#ifndef __FLT_HAS_QUIET_NAN__
#define __FLT_HAS_QUIET_NAN__ 1
#endif
#ifndef __FLT_HAS_QUIET_NAN_
#define __FLT_HAS_QUIET_NAN_ 1
#endif
#ifndef __FLT_MAX_10_EXP__
#define __FLT_MAX_10_EXP__ 38
#endif
#ifndef __FLT_MAX_10_EXP_
#define __FLT_MAX_10_EXP_ 38
#endif
#ifndef SHT0_DIV8
#define SHT0_DIV8 SHT0_1
#endif
#ifndef SHT0_DIV128
#define SHT0_DIV128 SHT0_6
#endif
#ifndef RESERVED10_VECTOR
#define RESERVED10_VECTOR 20
#endif
#ifndef __LONG_MAX__
#define __LONG_MAX__ 2147483647L
#endif
#ifndef __LONG_MAX_
#define __LONG_MAX_ 2147483647L
#endif
#ifndef __DEC128_SUBNORMAL_MIN__
#define __DEC128_SUBNORMAL_MIN__ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef __DEC128_SUBNORMAL_MIN_
#define __DEC128_SUBNORMAL_MIN_ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef __FLT_HAS_INFINITY__
#define __FLT_HAS_INFINITY__ 1
#endif
#ifndef __FLT_HAS_INFINITY_
#define __FLT_HAS_INFINITY_ 1
#endif
#ifndef TLV_ADC12_1_TAG_
#define TLV_ADC12_1_TAG_ 0x10DA
#endif
#ifndef TLV_ADC12_1_TAG
#define TLV_ADC12_1_TAG 0x10DA
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef RESERVED1_VECTOR
#define RESERVED1_VECTOR 2
#endif
#ifndef __DEC64_MAX__
#define __DEC64_MAX__ 9.999999999999999E384DD
#endif
#ifndef __DEC64_MAX_
#define __DEC64_MAX_ 9.999999999999999E384DD
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR 48
#endif
#ifndef __CHAR16_TYPE__
#define __CHAR16_TYPE__ short unsigned int
#endif
#ifndef __CHAR16_TYPE_
#define __CHAR16_TYPE_ short unsigned int
#endif
#ifndef __PRAGMA_REDEFINE_EXTNAME
#define __PRAGMA_REDEFINE_EXTNAME 1
#endif
#ifndef SHS0
#define SHS0 0x0400
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0174
#endif
#ifndef TA0CCR1
#define TA0CCR1 0x0174
#endif
#ifndef __msp430x261x
#define __msp430x261x 
#endif
#ifndef DMA2TSEL0
#define DMA2TSEL0 0x0100
#endif
#ifndef DMA2TSEL1
#define DMA2TSEL1 0x0200
#endif
#ifndef DMA2TSEL2
#define DMA2TSEL2 0x0400
#endif
#ifndef DMA2TSEL3
#define DMA2TSEL3 0x0800
#endif
#ifndef DMADT0
#define DMADT0 0x1000
#endif
#ifndef DMADT1
#define DMADT1 0x2000
#endif
#ifndef DMADT2
#define DMADT2 0x4000
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef DIVS_DIV8
#define DIVS_DIV8 DIVS_3
#endif
#ifndef __DEC64_MANT_DIG__
#define __DEC64_MANT_DIG__ 16
#endif
#ifndef __DEC64_MANT_DIG_
#define __DEC64_MANT_DIG_ 16
#endif
#ifndef TA0CCR2_
#define TA0CCR2_ 0x0176
#endif
#ifndef TA0CCR2
#define TA0CCR2 0x0176
#endif
#ifndef FSSEL_MCLK
#define FSSEL_MCLK FSSEL_1
#endif
#ifndef DMA0SAL_
#define DMA0SAL_ 0x01D2
#endif
#ifndef DMA0SAL
#define DMA0SAL 0x01D2
#endif
#ifndef UCB1I2COA_
#define UCB1I2COA_ 0x017C
#endif
#ifndef UCB1I2COA
#define UCB1I2COA 0x017C
#endif
#ifndef SHT0_DIV192
#define SHT0_DIV192 SHT0_7
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 52
#endif
#ifndef __DEC32_MAX_EXP__
#define __DEC32_MAX_EXP__ 97
#endif
#ifndef __DEC32_MAX_EXP_
#define __DEC32_MAX_EXP_ 97
#endif
#ifndef P8REN_
#define P8REN_ 0x0015
#endif
#ifndef P8REN
#define P8REN 0x0015
#endif
#ifndef XT2OFF
#define XT2OFF 0x80
#endif
#ifndef SHT0_DIV16
#define SHT0_DIV16 SHT0_2
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef SHT0_DIV32
#define SHT0_DIV32 SHT0_3
#endif
#ifndef __LDBL_MANT_DIG__
#define __LDBL_MANT_DIG__ 24
#endif
#ifndef __LDBL_MANT_DIG_
#define __LDBL_MANT_DIG_ 24
#endif
#ifndef CONSEQ_SEQUENCE
#define CONSEQ_SEQUENCE CONSEQ_1
#endif
#ifndef __MSP430_HAS_PORT7_R__
#define __MSP430_HAS_PORT7_R__ 
#endif
#ifndef __MSP430_HAS_PORT7_R_
#define __MSP430_HAS_PORT7_R_ 
#endif
#ifndef SLSHR0
#define SLSHR0 0x0200
#endif
#ifndef SLSHR1
#define SLSHR1 0x0400
#endif
#ifndef __DBL_HAS_QUIET_NAN__
#define __DBL_HAS_QUIET_NAN__ 1
#endif
#ifndef __DBL_HAS_QUIET_NAN_
#define __DBL_HAS_QUIET_NAN_ 1
#endif
#ifndef SHT0_DIV64
#define SHT0_DIV64 SHT0_4
#endif
#ifndef ADC12CTL1_
#define ADC12CTL1_ 0x01A2
#endif
#ifndef ADC12CTL1
#define ADC12CTL1 0x01A2
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef __WCHAR_TYPE_
#define __WCHAR_TYPE_ int
#endif
#ifndef __SIZEOF_FLOAT__
#define __SIZEOF_FLOAT__ 4
#endif
#ifndef __SIZEOF_FLOAT_
#define __SIZEOF_FLOAT_ 4
#endif
#ifndef SHT0_DIV96
#define SHT0_DIV96 SHT0_5
#endif
#ifndef WRT
#define WRT 0x0040
#endif
#ifndef CAREF_025
#define CAREF_025 CAREF_1
#endif
#ifndef CONSEQ_SINGLE
#define CONSEQ_SINGLE CONSEQ_0
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef CAREF0
#define CAREF0 0x10
#endif
#ifndef CAREF1
#define CAREF1 0x20
#endif
#ifndef VLD_1_8V
#define VLD_1_8V 0x10
#endif
#ifndef ADC12MEM4_
#define ADC12MEM4_ 0x0148
#endif
#ifndef ADC12MEM4
#define ADC12MEM4 0x0148
#endif
#ifndef SHT0_DIV512
#define SHT0_DIV512 SHT0_10
#endif
#ifndef SREF_VEREF_AVSS
#define SREF_VEREF_AVSS SREF_2
#endif
#ifndef RESERVED6_VECTOR
#define RESERVED6_VECTOR 12
#endif
#ifndef __FLT_DIG__
#define __FLT_DIG__ 6
#endif
#ifndef __FLT_DIG_
#define __FLT_DIG_ 6
#endif
#ifndef __MSPGCC__
#define __MSPGCC__ 20110706
#endif
#ifndef __MSPGCC_
#define __MSPGCC_ 20110706
#endif
#ifndef CAREF_050
#define CAREF_050 CAREF_2
#endif
#ifndef __MSP430_HAS_USCI_AB1__
#define __MSP430_HAS_USCI_AB1__ 
#endif
#ifndef __MSP430_HAS_USCI_AB1_
#define __MSP430_HAS_USCI_AB1_ 
#endif
#ifndef EEI
#define EEI 0x0008
#endif
#ifndef __MSP430_HAS_MPY__
#define __MSP430_HAS_MPY__ 
#endif
#ifndef __MSP430_HAS_MPY_
#define __MSP430_HAS_MPY_ 
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef __INT_MAX_
#define __INT_MAX_ 32767
#endif
#ifndef SHT1_DIV256
#define SHT1_DIV256 SHT1_8
#endif
#ifndef MACS_
#define MACS_ 0x0136
#endif
#ifndef MACS
#define MACS 0x0136
#endif
#ifndef CNTL0
#define CNTL0 0x0800
#endif
#ifndef CNTL1
#define CNTL1 0x1000
#endif
#ifndef DMA2SAL_
#define DMA2SAL_ 0x01EA
#endif
#ifndef DMA2SAL
#define DMA2SAL 0x01EA
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef BCSCTL1_
#define BCSCTL1_ 0x0057
#endif
#ifndef BCSCTL1
#define BCSCTL1 0x0057
#endif
#ifndef USCIAB1RX_VECTOR
#define USCIAB1RX_VECTOR 34
#endif
#ifndef BCSCTL2_
#define BCSCTL2_ 0x0058
#endif
#ifndef BCSCTL2
#define BCSCTL2 0x0058
#endif
#ifndef DAC12RES
#define DAC12RES 0x1000
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef P2IE
#define P2IE 0x002D
#endif
#ifndef P7REN_
#define P7REN_ 0x0014
#endif
#ifndef P7REN
#define P7REN 0x0014
#endif
#ifndef BCSCTL3_
#define BCSCTL3_ 0x0053
#endif
#ifndef BCSCTL3
#define BCSCTL3 0x0053
#endif
#ifndef __FLT_MAX_EXP__
#define __FLT_MAX_EXP__ 128
#endif
#ifndef __FLT_MAX_EXP_
#define __FLT_MAX_EXP_ 128
#endif
#ifndef UCA0RXBUF_
#define UCA0RXBUF_ 0x0066
#endif
#ifndef UCA0RXBUF
#define UCA0RXBUF 0x0066
#endif
#ifndef SHT0_DIV1024
#define SHT0_DIV1024 SHT0_12
#endif
#ifndef SHS_TBCCR0
#define SHS_TBCCR0 SHS_2
#endif
#ifndef SHS_TBCCR1
#define SHS_TBCCR1 SHS_3
#endif
#ifndef __DBL_MANT_DIG__
#define __DBL_MANT_DIG__ 24
#endif
#ifndef __DBL_MANT_DIG_
#define __DBL_MANT_DIG_ 24
#endif
#ifndef UCB1I2CSA_
#define UCB1I2CSA_ 0x017E
#endif
