jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x261x.cpp
#ifndef UCB1I2CSA
#define UCB1I2CSA 0x017E
#endif
#ifndef CAL_ADC_25T85
#define CAL_ADC_25T85 0x0007
#endif
#ifndef BSLSKEY_
#define BSLSKEY_ 0xFFbE
#endif
#ifndef BSLSKEY
#define BSLSKEY 0xFFbE
#endif
#ifndef __DEC64_MIN__
#define __DEC64_MIN__ 1E-383DD
#endif
#ifndef __DEC64_MIN_
#define __DEC64_MIN_ 1E-383DD
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __WINT_TYPE_
#define __WINT_TYPE_ unsigned int
#endif
#ifndef __SIZEOF_SHORT__
#define __SIZEOF_SHORT__ 2
#endif
#ifndef __SIZEOF_SHORT_
#define __SIZEOF_SHORT_ 2
#endif
#ifndef UCB0TXBUF_
#define UCB0TXBUF_ 0x006F
#endif
#ifndef UCB0TXBUF
#define UCB0TXBUF 0x006F
#endif
#ifndef CAOUT
#define CAOUT 0x01
#endif
#ifndef __MSP430_HAS_PORT6_R__
#define __MSP430_HAS_PORT6_R__ 
#endif
#ifndef __MSP430_HAS_PORT6_R_
#define __MSP430_HAS_PORT6_R_ 
#endif
#ifndef SELM_DCOCLK
#define SELM_DCOCLK SELM_0
#endif
#ifndef ENC
#define ENC 0x0002
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef CALDCO_16MHZ_
#define CALDCO_16MHZ_ 0x10F8
#endif
#ifndef CALDCO_16MHZ
#define CALDCO_16MHZ 0x10F8
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef IFG1
#define IFG1 0x0002
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef MAC_
#define MAC_ 0x0134
#endif
#ifndef MAC
#define MAC 0x0134
#endif
#ifndef EOS
#define EOS 0x80
#endif
#ifndef LOCKA
#define LOCKA 0x0040
#endif
#ifndef CACTL2_
#define CACTL2_ 0x005A
#endif
#ifndef CACTL2
#define CACTL2 0x005A
#endif
#ifndef IFG2_
#define IFG2_ 0x0003
#endif
#ifndef IFG2
#define IFG2 0x0003
#endif
#ifndef __MSP430_HAS_USCI__
#define __MSP430_HAS_USCI__ 
#endif
#ifndef __MSP430_HAS_USCI_
#define __MSP430_HAS_USCI_ 
#endif
#ifndef CAL_ADC_15T85
#define CAL_ADC_15T85 0x0004
#endif
#ifndef ADC12MCTL
#define ADC12MCTL ADC12MCTL_
#endif
#ifndef ADC12BUSY
#define ADC12BUSY 0x0001
#endif
#ifndef CAL_DCO_8MHZ
#define CAL_DCO_8MHZ 0x0004
#endif
#ifndef __LDBL_MAX_10_EXP__
#define __LDBL_MAX_10_EXP__ 38
#endif
#ifndef __LDBL_MAX_10_EXP_
#define __LDBL_MAX_10_EXP_ 38
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef P2IN
#define P2IN 0x0028
#endif
#ifndef DMA1SZ_
#define DMA1SZ_ 0x01E6
#endif
#ifndef DMA1SZ
#define DMA1SZ 0x01E6
#endif
#ifndef DAC12GRP
#define DAC12GRP 0x0001
#endif
#ifndef P8DIR_
#define P8DIR_ 0x003D
#endif
#ifndef P8DIR
#define P8DIR 0x003D
#endif
#ifndef DMA1SA_
#define DMA1SA_ 0x01DE
#endif
#ifndef DMA1SA
#define DMA1SA 0x01DE
#endif
#ifndef BSLSKEY_DISABLE
#define BSLSKEY_DISABLE 0xAA55
#endif
#ifndef __MSP430_HAS_SVS__
#define __MSP430_HAS_SVS__ 
#endif
#ifndef __MSP430_HAS_SVS_
#define __MSP430_HAS_SVS_ 
#endif
#ifndef __SIZEOF_WCHAR_T__
#define __SIZEOF_WCHAR_T__ 2
#endif
#ifndef __SIZEOF_WCHAR_T_
#define __SIZEOF_WCHAR_T_ 2
#endif
#ifndef CLLD0
#define CLLD0 0x0200
#endif
#ifndef CLLD1
#define CLLD1 0x0400
#endif
#ifndef UCB0STAT_
#define UCB0STAT_ 0x006D
#endif
#ifndef UCB0STAT
#define UCB0STAT 0x006D
#endif
#ifndef CONSEQ_REPEAT_SINGLE
#define CONSEQ_REPEAT_SINGLE CONSEQ_2
#endif
#ifndef CONSEQ0
#define CONSEQ0 0x0002
#endif
#ifndef CONSEQ1
#define CONSEQ1 0x0004
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef UCA1STAT_
#define UCA1STAT_ 0x00D5
#endif
#ifndef UCA1STAT
#define UCA1STAT 0x00D5
#endif
#ifndef TAG_DCO_30
#define TAG_DCO_30 0x01
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef SHT0_DIV4
#define SHT0_DIV4 SHT0_0
#endif
#ifndef ADC_VECTOR
#define ADC_VECTOR ADC12_VECTOR
#endif
#ifndef P6REN_
#define P6REN_ 0x0013
#endif
#ifndef P6REN
#define P6REN 0x0013
#endif
#ifndef UCA0ABCTL_
#define UCA0ABCTL_ 0x005D
#endif
#ifndef UCA0ABCTL
#define UCA0ABCTL 0x005D
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef RESERVED0_VECTOR
#define RESERVED0_VECTOR 0
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef CALBC1_12MHZ_
#define CALBC1_12MHZ_ 0x10FB
#endif
#ifndef CALBC1_12MHZ
#define CALBC1_12MHZ 0x10FB
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 50
#endif
#ifndef __DEC_EVAL_METHOD__
#define __DEC_EVAL_METHOD__ 2
#endif
#ifndef __DEC_EVAL_METHOD_
#define __DEC_EVAL_METHOD_ 2
#endif
#ifndef INCH_VEREF_MINUS
#define INCH_VEREF_MINUS 9
#endif
#ifndef UCB0CTL0_
#define UCB0CTL0_ 0x0068
#endif
#ifndef UCB0CTL0
#define UCB0CTL0 0x0068
#endif
#ifndef __MSP430_HAS_DMAIV__
#define __MSP430_HAS_DMAIV__ 
#endif
#ifndef __MSP430_HAS_DMAIV_
#define __MSP430_HAS_DMAIV_ 
#endif
#ifndef __MSP430_HAS_PORT5_R__
#define __MSP430_HAS_PORT5_R__ 
#endif
#ifndef __MSP430_HAS_PORT5_R_
#define __MSP430_HAS_PORT5_R_ 
#endif
#ifndef UCB0CTL1_
#define UCB0CTL1_ 0x0069
#endif
#ifndef UCB0CTL1
#define UCB0CTL1 0x0069
#endif
#ifndef DIVS_DIV1
#define DIVS_DIV1 DIVS_0
#endif
#ifndef DIVS_DIV2
#define DIVS_DIV2 DIVS_1
#endif
#ifndef DIVS_DIV4
#define DIVS_DIV4 DIVS_2
#endif
#ifndef BSLSKEY_NO_ERASE
#define BSLSKEY_NO_ERASE 0x0000
#endif
#ifndef CAREF_OFF
#define CAREF_OFF CAREF_0
#endif
#ifndef ERASE
#define ERASE 0x0002
#endif
#ifndef UCA0MCTL_
#define UCA0MCTL_ 0x0064
#endif
#ifndef UCA0MCTL
#define UCA0MCTL 0x0064
#endif
#ifndef __MSP430_HAS_CAPLUS__
#define __MSP430_HAS_CAPLUS__ 
#endif
#ifndef __MSP430_HAS_CAPLUS_
#define __MSP430_HAS_CAPLUS_ 
#endif
#ifndef __INTMAX_MAX__
#define __INTMAX_MAX__ 9223372036854775807LL
#endif
#ifndef __INTMAX_MAX_
#define __INTMAX_MAX_ 9223372036854775807LL
#endif
#ifndef __FLT_DENORM_MIN__
#define __FLT_DENORM_MIN__ 1.40129846e-45F
#endif
#ifndef __FLT_DENORM_MIN_
#define __FLT_DENORM_MIN_ 1.40129846e-45F
#endif
#ifndef P5IN_
#define P5IN_ 0x0030
#endif
#ifndef P5IN
#define P5IN 0x0030
#endif
#ifndef CAL_BC1_16MHZ
#define CAL_BC1_16MHZ 0x0001
#endif
#ifndef INCH_TEMP
#define INCH_TEMP 10
#endif
#ifndef P7DIR_
#define P7DIR_ 0x003C
#endif
#ifndef P7DIR
#define P7DIR 0x003C
#endif
#ifndef __CHAR32_TYPE__
#define __CHAR32_TYPE__ unsigned int
#endif
#ifndef __CHAR32_TYPE_
#define __CHAR32_TYPE_ unsigned int
#endif
#ifndef __FLT_MAX__
#define __FLT_MAX__ 3.40282347e+38F
#endif
#ifndef __FLT_MAX_
#define __FLT_MAX_ 3.40282347e+38F
#endif
#ifndef TBCLGRP0
#define TBCLGRP0 0x2000
#endif
#ifndef TBCLGRP1
#define TBCLGRP1 0x4000
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef IE1
#define IE1 0x0000
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef TAIV
#define TAIV TA0IV_
#endif
#ifndef USCIAB0RX_VECTOR
#define USCIAB0RX_VECTOR 46
#endif
#ifndef __SIZEOF_DOUBLE__
#define __SIZEOF_DOUBLE__ 4
#endif
#ifndef __SIZEOF_DOUBLE_
#define __SIZEOF_DOUBLE_ 4
#endif
#ifndef ADC12MEM0_
#define ADC12MEM0_ ADC12MEM_
#endif
#ifndef ADC12MEM0
#define ADC12MEM0 ADC12MEM_
#endif
#ifndef DMADSTBYTE
#define DMADSTBYTE 0x0080
#endif
#ifndef FSSEL0
#define FSSEL0 0x0040
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef __INTMAX_TYPE__
#define __INTMAX_TYPE__ long long int
#endif
#ifndef __INTMAX_TYPE_
#define __INTMAX_TYPE_ long long int
#endif
#ifndef FSSEL1
#define FSSEL1 0x0080
#endif
#ifndef ADC12MEM1_
#define ADC12MEM1_ 0x0142
#endif
#ifndef ADC12MEM1
#define ADC12MEM1 0x0142
#endif
#ifndef CAL_ADC_GAIN_FACTOR
#define CAL_ADC_GAIN_FACTOR 0x0000
#endif
#ifndef __DEC128_MAX_EXP__
#define __DEC128_MAX_EXP__ 6145
#endif
#ifndef __DEC128_MAX_EXP_
#define __DEC128_MAX_EXP_ 6145
#endif
#ifndef SHR0
#define SHR0 0x2000
#endif
#ifndef SHR1
#define SHR1 0x4000
#endif
#ifndef P5REN_
#define P5REN_ 0x0012
#endif
#ifndef P5REN
#define P5REN 0x0012
#endif
#ifndef UCB1STAT_
#define UCB1STAT_ 0x00DD
#endif
#ifndef UCB1STAT
#define UCB1STAT 0x00DD
#endif
#ifndef ADC12MEM3_
#define ADC12MEM3_ 0x0146
#endif
#ifndef ADC12MEM3
#define ADC12MEM3 0x0146
#endif
#ifndef SHS1
#define SHS1 0x0800
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 5
#endif
#ifndef __GNUC_MINOR_
#define __GNUC_MINOR_ 5
#endif
#ifndef __UINTMAX_MAX__
#define __UINTMAX_MAX__ 18446744073709551615ULL
#endif
#ifndef __UINTMAX_MAX_
#define __UINTMAX_MAX_ 18446744073709551615ULL
#endif
#ifndef CASHORT
#define CASHORT 0x80
#endif
#ifndef __DEC32_MANT_DIG__
#define __DEC32_MANT_DIG__ 7
#endif
#ifndef __DEC32_MANT_DIG_
#define __DEC32_MANT_DIG_ 7
#endif
#ifndef COMPARATORA_VECTOR
#define COMPARATORA_VECTOR 54
#endif
#ifndef ADC12MEM5_
#define ADC12MEM5_ 0x014A
#endif
#ifndef ADC12MEM5
#define ADC12MEM5 0x014A
#endif
#ifndef TLV_ADC12_1_LEN_
#define TLV_ADC12_1_LEN_ 0x10DB
#endif
#ifndef TLV_ADC12_1_LEN
#define TLV_ADC12_1_LEN 0x10DB
#endif
#ifndef __DBL_MAX_10_EXP__
#define __DBL_MAX_10_EXP__ 38
#endif
#ifndef __DBL_MAX_10_EXP_
#define __DBL_MAX_10_EXP_ 38
#endif
#ifndef __MSP430_HAS_TB7__
#define __MSP430_HAS_TB7__ 
#endif
#ifndef __MSP430_HAS_TB7_
#define __MSP430_HAS_TB7_ 
#endif
#ifndef CALBC1_8MHZ_
#define CALBC1_8MHZ_ 0x10FD
#endif
#ifndef CALBC1_8MHZ
#define CALBC1_8MHZ 0x10FD
#endif
#ifndef __LDBL_DENORM_MIN__
#define __LDBL_DENORM_MIN__ 1.40129846e-45L
#endif
#ifndef __LDBL_DENORM_MIN_
#define __LDBL_DENORM_MIN_ 1.40129846e-45L
#endif
#ifndef ADC12MEM6_
#define ADC12MEM6_ 0x014C
#endif
#ifndef ADC12MEM6
#define ADC12MEM6 0x014C
#endif
#ifndef RESERVED5_VECTOR
#define RESERVED5_VECTOR 10
#endif
#ifndef __MSP430_HAS_PORT4_R__
#define __MSP430_HAS_PORT4_R__ 
#endif
#ifndef __MSP430_HAS_PORT4_R_
#define __MSP430_HAS_PORT4_R_ 
#endif
#ifndef ADC12MEM7_
#define ADC12MEM7_ 0x014E
#endif
#ifndef ADC12MEM7
#define ADC12MEM7 0x014E
#endif
#ifndef SHT1_DIV4
#define SHT1_DIV4 SHT1_0
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0_
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef __STDC_
#define __STDC_ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef __MSP430_HAS_ADC12__
#define __MSP430_HAS_ADC12__ 
#endif
#ifndef __MSP430_HAS_ADC12_
#define __MSP430_HAS_ADC12_ 
#endif
#ifndef ADC12MEM8_
#define ADC12MEM8_ 0x0150
#endif
#ifndef ADC12MEM8
#define ADC12MEM8 0x0150
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ long int
#endif
#ifndef __PTRDIFF_TYPE_
#define __PTRDIFF_TYPE_ long int
#endif
#ifndef TACCTL1_
#define TACCTL1_ TA0CCTL1_
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1_
#endif
#ifndef INCH_0
#define INCH_0 0
#endif
#ifndef INCH_1
#define INCH_1 1
#endif
#ifndef INCH_2
#define INCH_2 2
#endif
#ifndef INCH_3
#define INCH_3 3
#endif
#ifndef INCH_4
#define INCH_4 4
#endif
#ifndef INCH_5
#define INCH_5 5
#endif
#ifndef INCH_7
#define INCH_7 7
#endif
#ifndef INCH_8
#define INCH_8 8
#endif
#ifndef INCH_9
#define INCH_9 9
#endif
#ifndef TAIV_OVERFLOW
#define TAIV_OVERFLOW 0x0A
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef P2IES
#define P2IES 0x002C
#endif
#ifndef ADC12MEM9_
#define ADC12MEM9_ 0x0152
#endif
#ifndef ADC12MEM9
#define ADC12MEM9 0x0152
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef P8IN_
#define P8IN_ 0x0039
#endif
#ifndef P8IN
#define P8IN 0x0039
#endif
#ifndef DMA2DA_
#define DMA2DA_ 0x01EE
#endif
#ifndef DMA2DA
#define DMA2DA 0x01EE
#endif
#ifndef __msp430_headers_compa_h
#define __msp430_headers_compa_h 
#endif
#ifndef UCB1CTL0_
#define UCB1CTL0_ 0x00D8
#endif
#ifndef UCB1CTL0
#define UCB1CTL0 0x00D8
#endif
#ifndef P6DIR_
#define P6DIR_ 0x0036
#endif
#ifndef P6DIR
#define P6DIR 0x0036
#endif
#ifndef TBIV_CCR1
#define TBIV_CCR1 0x02
#endif
#ifndef TBIV_CCR2
#define TBIV_CCR2 0x04
#endif
#ifndef TBIV_CCR3
#define TBIV_CCR3 0x06
#endif
#ifndef TBIV_CCR4
#define TBIV_CCR4 0x08
#endif
#ifndef TBIV_CCR5
#define TBIV_CCR5 0x0A
#endif
#ifndef TBIV_CCR6
#define TBIV_CCR6 0x0C
#endif
#ifndef __DEC64_SUBNORMAL_MIN__
#define __DEC64_SUBNORMAL_MIN__ 0.000000000000001E-383DD
#endif
#ifndef __DEC64_SUBNORMAL_MIN_
#define __DEC64_SUBNORMAL_MIN_ 0.000000000000001E-383DD
#endif
#ifndef __DEC128_MANT_DIG__
#define __DEC128_MANT_DIG__ 34
#endif
#ifndef __DEC128_MANT_DIG_
#define __DEC128_MANT_DIG_ 34
#endif
#ifndef UCB1CTL1_
#define UCB1CTL1_ 0x00D9
#endif
#ifndef UCB1CTL1
#define UCB1CTL1 0x00D9
#endif
#ifndef __MSP430_CPU__
#define __MSP430_CPU__ 0
#endif
#ifndef __MSP430_CPU_
#define __MSP430_CPU_ 0
#endif
#ifndef CAL_ADC_OFFSET
#define CAL_ADC_OFFSET 0x0001
#endif
#ifndef __SIZEOF_LONG_LONG__
#define __SIZEOF_LONG_LONG__ 8
#endif
#ifndef __SIZEOF_LONG_LONG_
#define __SIZEOF_LONG_LONG_ 8
#endif
#ifndef UCA0TXBUF_
#define UCA0TXBUF_ 0x0067
#endif
#ifndef UCA0TXBUF
#define UCA0TXBUF 0x0067
#endif
#ifndef UCA1MCTL_
#define UCA1MCTL_ 0x00D4
#endif
#ifndef UCA1MCTL
#define UCA1MCTL 0x00D4
#endif
#ifndef TLV_DCO_30_TAG_
#define TLV_DCO_30_TAG_ 0x10F6
#endif
#ifndef TLV_DCO_30_TAG
#define TLV_DCO_30_TAG 0x10F6
#endif
#ifndef __LDBL_DIG__
#define __LDBL_DIG__ 6
#endif
#ifndef __LDBL_DIG_
#define __LDBL_DIG_ 6
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef ENNMI
#define ENNMI 0x0001
#endif
#ifndef __GNUC_GNU_INLINE__
#define __GNUC_GNU_INLINE__ 1
#endif
#ifndef __GNUC_GNU_INLINE_
#define __GNUC_GNU_INLINE_ 1
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef CAREF_VT
#define CAREF_VT CAREF_3
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef INCH_A0
#define INCH_A0 0
#endif
#ifndef CAPD0
#define CAPD0 0x01
#endif
#ifndef CAPD1
#define CAPD1 0x02
#endif
#ifndef CAPD2
#define CAPD2 0x04
#endif
#ifndef CAPD3
#define CAPD3 0x08
#endif
#ifndef CAPD4
#define CAPD4 0x10
#endif
#ifndef CAPD5
#define CAPD5 0x20
#endif
#ifndef CAPD6
#define CAPD6 0x40
#endif
#ifndef CAPD7
#define CAPD7 0x80
#endif
#ifndef INCH_A7
#define INCH_A7 7
#endif
#ifndef DMAIFG
#define DMAIFG 0x0008
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef P4REN_
#define P4REN_ 0x0011
#endif
#ifndef P4REN
#define P4REN 0x0011
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef SHT1_DIV8
#define SHT1_DIV8 SHT1_1
#endif
#ifndef CAPD_
#define CAPD_ 0x005B
#endif
#ifndef CAPD
#define CAPD 0x005B
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#ifndef TAG_EMPTY
#define TAG_EMPTY 0xFE
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430x261x : public Variant {
	public:
		Variant_msp430x261x() {}
		virtual ~Variant_msp430x261x() {}
		const char *getName() { return "msp430x261x"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


